package SelfStudy.ss221002;

public class FirstJavaClass {

	public static void main(String[] args) {
		System.out.println("자바 수업이 끝난후 1차 프로젝트를 수행하였고, 이후 html,웹java수업중이다.");
		System.out.println("잔디 심는게 어떤것인지 이제야 알게되었고, 깃허브를 이용하여 매일 학습 내용을 커밋할 계획이다.");
		System.out.println("잔디가 빠짐없이 진하게 심어지길 바라며 수료때까지 1일 1커밋을 목표로 한다.");
		System.out.println("평일 수업일에는 강의내용을 정리하여 학습한 내용을 커밋하고, 주말과 휴일에는 이전 복습내용을 커밋한다.");
		System.out.println("주로 휴일에는 과제 혹은 자바, 평일에는 웹 수업내용에 관한 내용을 정리하고자 한다.");
		System.out.println("수업시간에 메모했던 강사님 설명과 예제 내용을 연관지어 정리하여 차후 자바 학습 프로그램을 개발하는것을\n"
				+ "목표로 최대한 상세히 주석을 달아 복습할때 생각날 수 있도록 작성할 계획이다.\n"
				+ "매일 1커밋은 굉장히 힘들수도, 굉장히 수월할수도 있는 목표이며, 이는 그날 커밋하는 내용의 질에 따라 다를것이다.\n"
				+ "개인적인 일이 생겨 시간이 모자를때에는 커밋을 빼먹지않고 하는 데에 중점을 두겠다.\n"
				+ "혹시 이 글을 보시게 되는 다른 분들이 계신다면 이점 감안하여 훑어봐주세요.\n"
				+ "감사합니다!\n");
		System.out.print("아 오늘은 다른 학습과 이력서 수정등으로 인해 커밋 량이 얼마 안됩니다... 시작이 반이다!");
	}
}
